// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Про Chrome OS Image Creator";
"Menu Prefs" = "Налаштування…";
"Menu Services" = "Служби";
"Menu Hide" = "Сховати Chrome OS Image Creator";
"Menu Hide Others" = "Сховати інше";
"Menu Show All" = "Показати все";
"Menu Quit" = "Закрити Chrome OS Image Creator";
"Menu Window" = "Вікно";
"Menu Minimize" = "Згорнути";
"Menu Zoom" = "Масштаб";
"Menu Bring All To Front" = "Усе на передній план";
"Menu Help" = "Довідка";
"Menu App Help" = "Довідка Chrome OS Image Creator";

/* Buttons */
"Button Previous" = "Назад";
"Button Next" = "Далі";
"Button Stop" = "Зупинити";
"Button Done" = "Готово";

/* Tab: Select device model */
"Text Welcome" = "Цей інструмент дозволяє створювати карту SD чи карту флеш-пам’яті USB для відновлення пристрою з ОС Chrome.\n\nВведіть номер моделі свого пристрою з ОС Chrome (напр., SAMS ALEX BETA-US 8738). Він відображається в нижній частині екрана, який пропонує під’єднати пристрій для відновлення.";
"Text Model" = "Модель:";
"Button Local Image" = "Файл на комп’ютері…";

/* Tab: Select USB stick */
"Text Select Prompt" = "Виберіть знімний пристрій пам’яті, який потрібно використовувати для відновлення:";
"Text Insertion Prompt" = "Вставте карту SD чи карту флеш-пам’яті USB.";

/* Tab: Done */
"Text Congrats" = "Ваш носій готовий. Тепер його можна вилучити із системи й користуватися ним для відновлення пристрою з ОС Chrome.";

/* Sizes */
"Size Bytes" = " б";
"Size Kilobytes" = " Кб";
"Size Megabytes" = " Мб";
"Size Gigabytes" = " Гб";
"Size Terabytes" = " Тб";
"Size Petabytes" = " Пб";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "Ця програма не запускається.";
"NoDiskArb Informative" = "Під час запуску Disk Arbitration виникла проблема. Цього не мало статися.";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "Неможливо отримати список образів.";
"CantGetConfig Informative" = "Під час отримання списку доступних образів для відновлення виникла проблема (%1$@). Перевірте наявність з’єднання з мережею.";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "неможливо виділити ресурси для з’єднання";
"CantGetConfig Error DownloadError" = "під час завантаження сталася помилка";
"CantGetConfig Error StringCreate" = "неможливо використати відповідь";

/* Version error. */
"VersionError Message" = "Ця версія програми застара.";
"VersionError Informative" = "Завантажте новішу версію. Це версія %1$@; , а потрібна принаймні версія %2$@. %3$@";
"VersionError OK" = "Завантажте нову версію";

/* File dialog to select a local file. */
"SelectLocal File" = "Виберіть образ:";
"SelectLocal Button" = "Вибрати";

/* Alert on writing stick. */
"WriteAlert Message" = "Дійсно назавжди стерти %1$@?";
"WriteAlert Informative" = "Усі дані, які зараз зберігаються на ній, буде втрачено назавжди. Цю дію неможливо скасувати.";
"WriteAlert Cancel" = "Не стирати";
"WriteAlert OK" = "Стерти";

"TooSmallAlert Message" = "Картку %1$@ неможливо використати; вона замала.";
"TooSmallAlert Informative" = "Потрібна карта SD чи карта флеш-пам’яті USB ємністю принаймні %2$@.";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "Картку %1$@ неможливо використати; вона лише для читання.";
"NotWritable Informative" = "Карта SD чи карта флеш-пам’яті USB доступні лише для читання. Можливо, на ній є перемикач, який дозволяє записувати на неї. Інакше нею неможливо скористатися.";
"NotWritable OK" = "OK";

"Label SD Card" = "Карта SD";

/* Stick writing statuses. */
"Status Downloading" = "Завантаження…";
"Status Verifying Image" = "Підтвердження образу для відновлення…";
"Status Unpacking" = "Розпакування…";
"Status Claiming" = "Резервування…";
"Status Unmounting" = "Відключення…";
"Status Writing" = "Запис…";
"Status Verifying Media" = "Підтвердження носія для відновлення…";
"Status Ejecting" = "Витягування…";
"Status Done" = "Готово!";

"StatusAdd Attempt" = " (спроба %1$d)";

/* Errors */
"Failure Downloading" = "На жаль, сталася помилка (не вдалося завантажити вихідний образ). Повторити спробу?";
"Failure Verifying Return Value" = "На жаль, сталася помилка (не вдалося перевірити вихідний образ, помилка програми, %1$s). Повторити спробу?";
"Failure Verifying SHA Mismatch" = "На жаль, сталася помилка (не вдалося перевірити вихідний образ, помилка контрольної суми). Повторити спробу?";
"Failure Unpacking" = "На жаль, сталася помилка (не вдалося розпакувати вихідний образ, %1$s). Повторити спробу?";
"Failure Claiming" = "На жаль, сталася помилка (не вдалося зарезервувати картку USB). Повторити спробу?";
"Failure Unmounting" = "На жаль, сталася помилка (не вдалося відключити картку USB). Повторити спробу?";
"Failure Opening Source Image" = "На жаль, сталася помилка (не вдалося відкрити вихідний образ, %1$s). Повторити спробу?";
"Failure Opening Destination Device" = "На жаль, сталася помилка (не вдалося відкрити карту USB, %1$s). Повторити спробу?";
"Failure Reading Source Image" = "На жаль, сталася помилка (не вдалося зчитати з вихідного образу, %1$s). Повторити спробу?";
"Failure Writing Destination Device" = "На жаль, сталася помилка (не вдалося записати дані на картку USB, %1$s). Повторити спробу?";
"Failure Reading Destination Device" = "На жаль, сталася помилка (не вдалося зчитати з карти USB, %1$s). Повторити спробу?";
"Failure Resetting Source Image" = "На жаль, сталася помилка (не вдалося перемотати вихідний образ назад, %1$s). Повторити спробу?";
"Failure Resetting Destination Device" = "На жаль, сталася помилка (не вдалося перемотати карту USB назад, %1$s). Повторити спробу?";
"Failure Ejecting" = "На жаль, сталася помилка (не вдалося витягнути картку USB). Повторити спробу?";

"Failure Try Again" = "Повторити спробу";
"Failure Quit" = "Вийти";

"Failure Termination Status" = "Стан закінчення %d";

"Failure Internal Error 1" = "Неочікуваний кінець файлу";
